; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain depot)
;(:requirements :typing :fluents)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (located ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (located ?x ?y))
:effect (and (not (located ?x ?y)) (located ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (located ?x ?p) (available ?x) (located ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (located ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (located ?x ?p) (located ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (located ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (located ?x ?p) (located ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (located ?x ?p) (located ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob1935) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(located pallet0 depot0)
	(clear crate1)
	(located pallet1 distributor0)
	(clear crate4)
	(located pallet2 distributor1)
	(clear crate5)
	(located truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 457)
	(located truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 331)
	(located hoist0 depot0)
	(available hoist0)
	(located hoist1 distributor0)
	(available hoist1)
	(located hoist2 distributor1)
	(available hoist2)
	(located crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 99)
	(located crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 89)
	(located crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 67)
	(located crate3 distributor0)
	(on crate3 crate0)
	(= (weight crate3) 81)
	(located crate4 distributor0)
	(on crate4 crate3)
	(= (weight crate4) 4)
	(located crate5 distributor1)
	(on crate5 crate2)
	(= (weight crate5) 50)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet2)
		(on crate2 pallet0)
		(on crate3 crate2)
		(on crate4 pallet1)
		(on crate5 crate0)
	)
)

)

; plan
1. (lift hoist0 crate1 pallet0 depot0)
   deleted: (located crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 6
2. (lift hoist1 crate4 crate3 distributor0)
   deleted: (located crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate3)
   added: (lifting hoist1 crate4) (clear crate3)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 6
3. (lift hoist2 crate5 crate2 distributor1)
   deleted: (located crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate2)
   added: (lifting hoist2 crate5) (clear crate2)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 6
4. (drive truck1 distributor0 distributor1)
   deleted: (located truck1 distributor0)
   added: (located truck1 distributor1)
   changed: (fuel-cost) from 3 to 13
   goals met: 0 of 6
5. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 50
   goals met: 0 of 6
6. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (located crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 13 to 14
   goals met: 0 of 6
7. (load hoist2 crate2 truck1 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   changed: (current_load truck1) from 50 to 117
   goals met: 0 of 6
8. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 89
   goals met: 0 of 6
9. (drop hoist1 crate4 crate3 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate3)
   added: (available hoist1) (located crate4 distributor0) (clear crate4) (on crate4 crate3)
   goals met: 0 of 6
10. (drive truck1 distributor1 depot0)
   deleted: (located truck1 distributor1)
   added: (located truck1 depot0)
   changed: (fuel-cost) from 14 to 24
   goals met: 0 of 6
11. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck1) from 117 to 50
   goals met: 0 of 6
12. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (located crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 1 of 6
13. (drive truck0 depot0 distributor1)
   deleted: (located truck0 depot0)
   added: (located truck0 distributor1)
   changed: (fuel-cost) from 24 to 34
   goals met: 1 of 6
14. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 89 to 0
   goals met: 1 of 6
15. (drop hoist2 crate1 pallet2 distributor1)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (located crate1 distributor1) (clear crate1) (on crate1 pallet2)
   goals met: 2 of 6
16. (lift hoist1 crate4 crate3 distributor0)
   deleted: (located crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate3)
   added: (lifting hoist1 crate4) (clear crate3)
   changed: (fuel-cost) from 34 to 35
   goals met: 2 of 6
17. (drive truck1 depot0 distributor0)
   deleted: (located truck1 depot0)
   added: (located truck1 distributor0)
   changed: (fuel-cost) from 35 to 45
   goals met: 2 of 6
18. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   changed: (current_load truck1) from 50 to 54
   goals met: 2 of 6
19. (lift hoist1 crate3 crate0 distributor0)
   deleted: (located crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate0)
   added: (lifting hoist1 crate3) (clear crate0)
   changed: (fuel-cost) from 45 to 46
   goals met: 2 of 6
20. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   changed: (current_load truck1) from 54 to 135
   goals met: 2 of 6
21. (unload hoist1 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck1) from 135 to 85
   goals met: 2 of 6
22. (drop hoist1 crate5 crate0 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate0)
   added: (available hoist1) (located crate5 distributor0) (clear crate5) (on crate5 crate0)
   goals met: 3 of 6
23. (drive truck1 distributor0 depot0)
   deleted: (located truck1 distributor0)
   added: (located truck1 depot0)
   changed: (fuel-cost) from 46 to 56
   goals met: 3 of 6
24. (unload hoist0 crate3 truck1 depot0)
   deleted: (in crate3 truck1) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck1) from 85 to 4
   goals met: 3 of 6
25. (drop hoist0 crate3 crate2 depot0)
   deleted: (lifting hoist0 crate3) (clear crate2)
   added: (available hoist0) (located crate3 depot0) (clear crate3) (on crate3 crate2)
   goals met: 4 of 6
26. (drive truck0 distributor1 distributor0)
   deleted: (located truck0 distributor1)
   added: (located truck0 distributor0)
   changed: (fuel-cost) from 56 to 66
   goals met: 4 of 6
27. (lift hoist1 crate5 crate0 distributor0)
   deleted: (located crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate0)
   added: (lifting hoist1 crate5) (clear crate0)
   changed: (fuel-cost) from 66 to 67
   goals met: 3 of 6
28. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 50
   goals met: 3 of 6
29. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (located crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 67 to 68
   goals met: 3 of 6
30. (drive truck1 depot0 distributor0)
   deleted: (located truck1 depot0)
   added: (located truck1 distributor0)
   changed: (fuel-cost) from 68 to 78
   goals met: 3 of 6
31. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   changed: (current_load truck1) from 4 to 103
   goals met: 3 of 6
32. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 103 to 99
   goals met: 3 of 6
33. (drop hoist1 crate4 pallet1 distributor0)
   deleted: (lifting hoist1 crate4) (clear pallet1)
   added: (available hoist1) (located crate4 distributor0) (clear crate4) (on crate4 pallet1)
   goals met: 4 of 6
34. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 50 to 0
   goals met: 4 of 6
35. (drive truck1 distributor0 distributor1)
   deleted: (located truck1 distributor0)
   added: (located truck1 distributor1)
   changed: (fuel-cost) from 78 to 88
   goals met: 4 of 6
36. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck1) from 99 to 0
   goals met: 4 of 6
37. (drop hoist2 crate0 crate1 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate1)
   added: (available hoist2) (located crate0 distributor1) (clear crate0) (on crate0 crate1)
   goals met: 5 of 6
38. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 50
   goals met: 5 of 6
39. (drive truck0 distributor0 distributor1)
   deleted: (located truck0 distributor0)
   added: (located truck0 distributor1)
   changed: (fuel-cost) from 88 to 98
   goals met: 5 of 6
40. (unload hoist2 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   changed: (current_load truck0) from 50 to 0
   goals met: 5 of 6
41. (drop hoist2 crate5 crate0 distributor1)
   deleted: (lifting hoist2 crate5) (clear crate0)
   added: (available hoist2) (located crate5 distributor1) (clear crate5) (on crate5 crate0)
   goals met: 6 of 6
